#### Terraform Init: ✅
#### Terraform Format: ✅
#### Terraform Validate: ✅
#### Terraform Plan: ✅

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.entra.azuread_group.demo-group: Refreshing state... [id=/groups/0068b7b2-13e4-4929-a1e7-25eaf2b6a7ae]
module.intune.microsoft365wp_device_compliance_policy.android_compliance: Refreshing state... [id=f7a8685e-a6c8-4855-bd3c-dceb00fbbc89]
module.azure.azurerm_resource_group.rg1: Refreshing state... [id=/subscriptions/4c02c57c-ccc6-46d5-8b66-a557a6b40dc8/resourceGroups/chrsdrhm-rg1]
module.azure.azurerm_network_security_group.nsg1: Refreshing state... [id=/subscriptions/4c02c57c-ccc6-46d5-8b66-a557a6b40dc8/resourceGroups/chrsdrhm-rg1/providers/Microsoft.Network/networkSecurityGroups/chrsdrhm-nsg1]
module.azure.azurerm_virtual_network.vnet1: Refreshing state... [id=/subscriptions/4c02c57c-ccc6-46d5-8b66-a557a6b40dc8/resourceGroups/chrsdrhm-rg1/providers/Microsoft.Network/virtualNetworks/chrsdrhm-vnet1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.intune.microsoft365wp_device_compliance_policy.android_compliance is tainted, so must be replaced
-/+ resource "microsoft365wp_device_compliance_policy" "android_compliance" {
      ~ assignments                = [
          + {
              + target = {
                  + filter_id   = (known after apply)
                  + filter_type = "none"
                  + group       = {
                      + group_id = "0068b7b2-13e4-4929-a1e7-25eaf2b6a7ae"
                    }
                }
            },
        ]
      ~ created_date_time          = "2025-06-22T23:06:34.5482079Z" -> (known after apply)
      ~ id                         = "f7a8685e-a6c8-4855-bd3c-dceb00fbbc89" -> (known after apply)
      ~ last_modified_date_time    = "2025-06-22T23:06:34.5482079Z" -> (known after apply)
      ~ version                    = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

Actor: @chrsdrhm
Trigger: `pull_request`